src/bp-extension/Documents/ЛГ_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛГ_Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЛогистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявкиЛогистики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаявкиЛогистики</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявкиБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителяБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧистаяДельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тягач</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоКонечное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БухгалтерскиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправкаДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрекНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОтправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дебиторка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующего</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp-extension/Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетНаОплатуПокупателю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛГ_ЗаявкаОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛГ_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp-extension/Documents/ЛГ_Заявка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьСчет(Команда)

    Если Не Записать() Тогда
        Возврат;
	КонецЕсли;     

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Основание", Объект.Ссылка);

    ОткрытьФорму(
        "Документ.СчетНаОплатуПокупателю.ФормаОбъекта",
        ПараметрыФормы,
        ЭтаФорма);

	КонецПроцедуры       
	
	&НаСервере
Функция ПроверитьСвязьСчетаНаСервере()
                                                     
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Счета.Ссылка КАК Счет
        |ИЗ
        |   Документ.СчетНаОплатуПокупателю КАК Счета
        |ГДЕ
        |   Счета.ЛГ_ЗаявкаОснование = &Заявка
        |   И НЕ Счета.ПометкаУдаления";

    Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);

    Выборка = Запрос.Выполнить().Выбрать();
    Результат = "";

    Пока Выборка.Следующий() Цикл
        Результат = Результат + Строка(Выборка.Счет)
            + Символы.ПС;
    КонецЦикла;

    Если Результат = "" Тогда
        Возврат "Сохранённых счетов со ссылкой на эту заявку нет.";
    КонецЕсли;

    Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ЗагрузитьЗаявкуИзJSON(Команда)

    Если Не ЗначениеЗаполнено(Объект.Организация)
        Или Не ЗначениеЗаполнено(Объект.Контрагент)
        Или Не ЗначениеЗаполнено(Объект.Договор) Тогда

        Сообщить(
            "Перед загрузкой выберите организацию, заказчика "
            + "и договор, соответствующие заявке из файла.");
        Возврат;

    КонецЕсли;

    Диалог = Новый ДиалогВыбораФайла(
        РежимДиалогаВыбораФайла.Открытие);

    Диалог.Заголовок = "Выберите заявку из базы логистики";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.МножественныйВыбор = Ложь;

    Оповещение = Новый ОписаниеОповещения(
        "ЛГ_ПослеВыбораФайлаЗаявки",
        ЭтотОбъект);

    Диалог.Показать(Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ЛГ_ПослеВыбораФайлаЗаявки(
    ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Попытка

        ТекстовыйФайл = Новый ТекстовыйДокумент;
        ТекстовыйФайл.Прочитать(
            ВыбранныеФайлы[0],
            КодировкаТекста.UTF8);

        СообщениеЗагрузки = ЛГ_ЗаполнитьЗаявкуИзJSONНаСервере(
            ТекстовыйФайл.ПолучитьТекст());

        Модифицированность = Истина;
        Сообщить(СообщениеЗагрузки);

    Исключение

        Сообщить("Загрузка не выполнена: " + ОписаниеОшибки());

    КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ЛГ_ЗаполнитьЗаявкуИзJSONНаСервере(ТекстJSON)

    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ТекстJSON);
    Пакет = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();

    Если ТипЗнч(Пакет) <> Тип("Структура") Тогда
        ВызватьИсключение "Неверная структура JSON.";
    КонецЕсли;

    Версия = Неопределено;
    Направление = Неопределено;
    ДанныеЗаявки = Неопределено;

    Если Не Пакет.Свойство("ВерсияФормата", Версия) Тогда
        ВызватьИсключение "В файле отсутствует версия формата.";
    КонецЕсли;

    Если Версия <> 1 Тогда
        ВызватьИсключение "Поддерживается только версия формата 1.";
    КонецЕсли;

    Если Не Пакет.Свойство("Направление", Направление) Тогда
        ВызватьИсключение "В файле отсутствует направление обмена.";
    КонецЕсли;

    Если Направление <> "ЛогистикаВБухгалтерию" Тогда
        ВызватьИсключение "Этот файл не предназначен для загрузки в Бухгалтерию.";
    КонецЕсли;

    Если Не Пакет.Свойство("Заявка", ДанныеЗаявки) Тогда
        ВызватьИсключение "В файле отсутствуют данные заявки.";
    КонецЕсли;

    // Проверяем и приводим идентификатор к стандартному виду.
    Идентификатор = Строка(
        Новый УникальныйИдентификатор(
            ДанныеЗаявки.Идентификатор));

    ДокументЗаявки = РеквизитФормыВЗначение("Объект");

    Если ЗначениеЗаполнено(
        ДокументЗаявки.ИдентификаторЛогистики) Тогда

        Если ДокументЗаявки.ИдентификаторЛогистики
            <> Идентификатор Тогда

            ВызватьИсключение
                "Открытая заявка уже связана с другой заявкой логистики. "
                + "Откройте нужную заявку или создайте новую.";

        КонецЕсли;

    КонецЕсли;

    // Не допускаем привязку одного файла к двум заявкам.
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Заявки.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.ЛГ_Заявка КАК Заявки
        |ГДЕ
        |   Заявки.ИдентификаторЛогистики = &Идентификатор
        |   И Заявки.Ссылка <> &ТекущаяЗаявка";

    Запрос.УстановитьПараметр(
        "Идентификатор", Идентификатор);

    Запрос.УстановитьПараметр(
        "ТекущаяЗаявка", ДокументЗаявки.Ссылка);

    Выборка = Запрос.Выполнить().Выбрать();

    Если Выборка.Следующий() Тогда

        ВызватьИсключение
            "Этот файл уже связан с документом: "
            + Строка(Выборка.Ссылка)
            + ". Откройте его и выполните загрузку там.";

    КонецЕсли;

    Если Не ЗначениеЗаполнено(ДокументЗаявки.Организация)
        Или Не ЗначениеЗаполнено(ДокументЗаявки.Контрагент)
        Или Не ЗначениеЗаполнено(ДокументЗаявки.Договор) Тогда

        ВызватьИсключение
            "Заполните организацию, заказчика и договор.";

    КонецЕсли;

    Если ДокументЗаявки.Договор.Владелец
        <> ДокументЗаявки.Контрагент Тогда

        ВызватьИсключение
            "Выбранный договор принадлежит другому заказчику.";

    КонецЕсли;

    РеквизитыJSON = ДанныеЗаявки.Реквизиты;

    ДокументЗаявки.ИдентификаторЛогистики = Идентификатор;
    ДокументЗаявки.НомерЗаявкиЛогистики = ДанныеЗаявки.Номер;
    ДокументЗаявки.ДатаЗаявкиЛогистики =
        ЛГ_ДатаИзJSON(ДанныеЗаявки.Дата);

    // Переносим только согласованные реквизиты.
    // Организация, контрагент и договор остаются выбранными в форме.
    ИменаПолей = СтрРазделить(
        "НомерЗаявки,СрокОплаты,"
        + "Загрузка_Дата,Загрузка_Пункт,"
        + "Выгрузка_Дата,Выгрузка_Пункт,"
        + "СуммаЗаявки,СуммаЗаявкиБезНДС,"
        + "СуммаИсполнителя,СуммаИсполнителяБезНДС,"
        + "ЧистаяДельта,БезНДС,СтавкаНДС,"
        + "ИсполнительБезНДС,СтавкаНДСИсполнителя,"
        + "Логист,Отдел,Водитель,Тягач,Прицеп",
        ",");

    Для Каждого ИмяПоля Из ИменаПолей Цикл

        ЗначениеJSON = Неопределено;

        Если Не РеквизитыJSON.Свойство(
            ИмяПоля, ЗначениеJSON) Тогда

            ВызватьИсключение
                "В файле отсутствует реквизит: " + ИмяПоля;

        КонецЕсли;

        Если ДокументЗаявки.Метаданные().Реквизиты.Найти(
            ИмяПоля) = Неопределено Тогда

            ВызватьИсключение
                "В документе ЛГ_Заявка отсутствует реквизит: "
                + ИмяПоля;

        КонецЕсли;

        Если ИмяПоля = "СрокОплаты"
            Или ИмяПоля = "Загрузка_Дата"
            Или ИмяПоля = "Выгрузка_Дата" Тогда

            ДокументЗаявки[ИмяПоля] =
                ЛГ_ДатаИзJSON(ЗначениеJSON);

        ИначеЕсли ИмяПоля = "Логист"
            Или ИмяПоля = "Отдел"
            Или ИмяПоля = "Водитель"
            Или ИмяПоля = "Тягач"
            Или ИмяПоля = "Прицеп" Тогда

            ДокументЗаявки[ИмяПоля] =
                ЛГ_НаименованиеИзJSON(ЗначениеJSON);

        Иначе

            ДокументЗаявки[ИмяПоля] = ЗначениеJSON;

        КонецЕсли;

    КонецЦикла;

    // Эти таблицы загружаются целиком, поэтому строки не дублируются.
    ИменаТаблиц = СтрРазделить(
        "ОтправкаДокументов,Дебиторка", ",");

    Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл

        СтрокиJSON = Неопределено;

        Если Не ДанныеЗаявки.ТабличныеЧасти.Свойство(
            ИмяТаблицы, СтрокиJSON) Тогда

            ВызватьИсключение
                "В файле отсутствует таблица: " + ИмяТаблицы;

        КонецЕсли;

        ОписаниеТаблицы =
            ДокументЗаявки.Метаданные().ТабличныеЧасти.Найти(
                ИмяТаблицы);

        Если ОписаниеТаблицы = Неопределено Тогда

            ВызватьИсключение
                "В документе отсутствует таблица: " + ИмяТаблицы;

        КонецЕсли;

        ТаблицаДокумента = ДокументЗаявки[ИмяТаблицы];
        ТаблицаДокумента.Очистить();

        Для Каждого СтрокаJSON Из СтрокиJSON Цикл

            НоваяСтрока = ТаблицаДокумента.Добавить();

            Для Каждого Колонка Из ОписаниеТаблицы.Реквизиты Цикл

                ЗначениеJSON = Неопределено;

                Если СтрокаJSON.Свойство(
                    Колонка.Имя, ЗначениеJSON) Тогда

                    Если Колонка.Тип.СодержитТип(Тип("Дата")) Тогда

                        НоваяСтрока[Колонка.Имя] =
                            ЛГ_ДатаИзJSON(ЗначениеJSON);

                    Иначе

                        НоваяСтрока[Колонка.Имя] = ЗначениеJSON;

                    КонецЕсли;

                КонецЕсли;

            КонецЦикла;

        КонецЦикла;

    КонецЦикла;

    // Оплаты и бухгалтерские документы не загружаем из логистики.
    ДокументЗаявки.СуммаОплаты =
        ДокументЗаявки.Оплаты.Итог("Сумма");

    ДокументЗаявки.СальдоКонечное =
        ДокументЗаявки.СуммаЗаявки - ДокументЗаявки.СуммаОплаты;

    // Обновляем форму только после успешного заполнения.
    ЗначениеВРеквизитФормы(ДокументЗаявки, "Объект");

    Возврат
        "Загружена заявка логистики № " + ДанныеЗаявки.Номер
        + ". Заказчик в файле: "
        + ЛГ_НаименованиеИзJSON(РеквизитыJSON.Контрагент)
        + "; договор в файле: "
        + ЛГ_НаименованиеИзJSON(РеквизитыJSON.Договор)
        + ". Проверьте выбранные организацию, заказчика и договор. "
        + "Для сохранения результата нажмите «Записать».";

КонецФункции


&НаСервереБезКонтекста
Функция ЛГ_ДатаИзJSON(ЗначениеJSON)

    Если ЗначениеJSON = Неопределено
        Или ЗначениеJSON = Null Тогда

        Возврат Дата(1, 1, 1);

    КонецЕсли;

    Если ТипЗнч(ЗначениеJSON) <> Тип("Строка") Тогда
        ВызватьИсключение "Дата в JSON должна быть строкой.";
    КонецЕсли;

    Если СтрДлина(ЗначениеJSON) <> 19 Тогда

        ВызватьИсключение
            "Неверный формат даты: " + ЗначениеJSON;

    КонецЕсли;

    Возврат Дата(
        Число(Сред(ЗначениеJSON, 1, 4)),
        Число(Сред(ЗначениеJSON, 6, 2)),
        Число(Сред(ЗначениеJSON, 9, 2)),
        Число(Сред(ЗначениеJSON, 12, 2)),
        Число(Сред(ЗначениеJSON, 15, 2)),
        Число(Сред(ЗначениеJSON, 18, 2)));

КонецФункции


&НаСервереБезКонтекста
Функция ЛГ_НаименованиеИзJSON(ЗначениеJSON)

    Если ЗначениеJSON = Неопределено
        Или ЗначениеJSON = Null Тогда

        Возврат "";

    КонецЕсли;

    Если ТипЗнч(ЗначениеJSON) <> Тип("Структура") Тогда

        ВызватьИсключение
            "Неверный формат ссылки на справочник в JSON.";

    КонецЕсли;

    Наименование = "";

    Если Не ЗначениеJSON.Свойство(
        "Наименование", Наименование) Тогда

        ВызватьИсключение
            "В данных справочника отсутствует наименование.";

    КонецЕсли;

    Возврат Наименование;

КонецФункции

&НаКлиенте
Процедура ВыгрузитьРезультатВJSON(Команда)

    Если Не ЗначениеЗаполнено(Объект.ИдентификаторЛогистики) Тогда

        Сообщить(
            "Сначала загрузите заявку из логистики: "
            + "не заполнен идентификатор заявки.");
        Возврат;

    КонецЕсли;

    Если Не Записать() Тогда
        Возврат;
    КонецЕсли;

    Попытка
        ТекстJSON = ЛГ_СформироватьРезультатОбменаНаСервере();
    Исключение
        Сообщить("Выгрузка не выполнена: " + ОписаниеОшибки());
        Возврат;
    КонецПопытки;

    Диалог = Новый ДиалогВыбораФайла(
        РежимДиалогаВыбораФайла.Сохранение);

    Диалог.Заголовок = "Сохранить результат для логистики";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.МножественныйВыбор = Ложь;

    Диалог.ПолноеИмяФайла =
        "БП_Заявка_"
        + СокрЛП(Объект.НомерЗаявкиЛогистики)
        + ".json";

    Оповещение = Новый ОписаниеОповещения(
        "ЛГ_ПослеВыбораФайлаРезультата",
        ЭтотОбъект,
        ТекстJSON);

    Диалог.Показать(Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ЛГ_ПослеВыбораФайлаРезультата(
    ВыбранныеФайлы, ТекстJSON) Экспорт

    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Попытка

        ТекстовыйФайл = Новый ТекстовыйДокумент;
        ТекстовыйФайл.УстановитьТекст(ТекстJSON);

        ТекстовыйФайл.Записать(
            ВыбранныеФайлы[0],
            КодировкаТекста.UTF8);

        Сообщить(
            "Результат выгружен: " + ВыбранныеФайлы[0]);

    Исключение

        Сообщить(
            "Не удалось сохранить файл: " + ОписаниеОшибки());

    КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ЛГ_СформироватьРезультатОбменаНаСервере()

    ДокументЗаявки = Объект.Ссылка.ПолучитьОбъект();

    Если Не ЗначениеЗаполнено(
        ДокументЗаявки.ИдентификаторЛогистики) Тогда

        ВызватьИсключение
            "Не заполнен идентификатор заявки логистики.";

    КонецЕсли;

    // Проверяем корректность идентификатора.
    ИдентификаторЛогистики = Строка(
        Новый УникальныйИдентификатор(
            ДокументЗаявки.ИдентификаторЛогистики));

    // Каждой оплате присваиваем постоянный идентификатор.
    // Сохраняем его в базе, чтобы повторная выгрузка
    // содержала тот же идентификатор платежа.
    ЕстьИзменения = Ложь;
    ИспользованныеИдентификаторы = Новый Соответствие;

    Для Каждого СтрокаОплаты Из ДокументЗаявки.Оплаты Цикл

        Если Не ЗначениеЗаполнено(СтрокаОплаты.ИдентификаторБП) Тогда

            СтрокаОплаты.ИдентификаторБП =
                Строка(Новый УникальныйИдентификатор);

            ЕстьИзменения = Истина;

        КонецЕсли;

        Если ИспользованныеИдентификаторы.Получить(
            СтрокаОплаты.ИдентификаторБП) <> Неопределено Тогда

            ВызватьИсключение
                "В таблице оплат повторяется идентификатор платежа. "
                + "Проверьте строку № "
                + Строка(СтрокаОплаты.НомерСтроки) + ".";

        КонецЕсли;

        ИспользованныеИдентификаторы.Вставить(
            СтрокаОплаты.ИдентификаторБП, Истина);

    КонецЦикла;

    Если ЕстьИзменения Тогда
        ДокументЗаявки.Записать(РежимЗаписиДокумента.Запись);
    КонецЕсли;

    // Возвращаем в форму сохранённые идентификаторы оплат.
    ЗначениеВРеквизитФормы(ДокументЗаявки, "Объект");

    // Получаем счета, связанные с этой заявкой.
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   Счета.Ссылка КАК Ссылка,
        |   Счета.Номер КАК Номер,
        |   Счета.Дата КАК Дата,
        |   Счета.СуммаДокумента КАК Сумма,
        |   Счета.Проведен КАК Проведен
        |ИЗ
        |   Документ.СчетНаОплатуПокупателю КАК Счета
        |ГДЕ
        |   Счета.ЛГ_ЗаявкаОснование = &Заявка
        |   И НЕ Счета.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО
        |   Счета.Дата,
        |   Счета.Номер";

    Запрос.УстановитьПараметр(
        "Заявка", ДокументЗаявки.Ссылка);

    ДокументыJSON = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл

        ДанныеСчета = Новый Структура;

        ДанныеСчета.Вставить(
            "ИдентификаторБП",
            Строка(Выборка.Ссылка.УникальныйИдентификатор()));

        ДанныеСчета.Вставить(
            "ТипДокумента", "СчетНаОплатуПокупателю");

        ДанныеСчета.Вставить(
            "ВидДокумента", "Счет покупателю");

        ДанныеСчета.Вставить("Номер", Выборка.Номер);

        ДанныеСчета.Вставить(
            "Дата", ЛГ_ДатаДляОбратногоJSON(Выборка.Дата));

        ДанныеСчета.Вставить("Сумма", Выборка.Сумма);
        ДанныеСчета.Вставить("Проведен", Выборка.Проведен);
        ДанныеСчета.Вставить("Комментарий", "");

        ДокументыJSON.Добавить(ДанныеСчета);

    КонецЦикла;

    // Выгружаем оплаты из таблицы нашей заявки.
    ОплатыJSON = Новый Массив;

    Для Каждого СтрокаОплаты Из ДокументЗаявки.Оплаты Цикл

        ДанныеОплаты = Новый Структура;

        ДанныеОплаты.Вставить(
            "ИдентификаторБП",
            СтрокаОплаты.ИдентификаторБП);

        ДанныеОплаты.Вставить(
            "Дата",
            ЛГ_ДатаДляОбратногоJSON(СтрокаОплаты.Дата));

        ДанныеОплаты.Вставить(
            "НомерДокумента",
            СтрокаОплаты.НомерДокумента);

        ДанныеОплаты.Вставить(
            "Сумма", СтрокаОплаты.Сумма);

        ДанныеОплаты.Вставить(
            "Комментарий", СтрокаОплаты.Комментарий);

        ОплатыJSON.Добавить(ДанныеОплаты);

    КонецЦикла;

    СуммаОплаты = ДокументЗаявки.Оплаты.Итог("Сумма");

    ДанныеЗаявки = Новый Структура;

    ДанныеЗаявки.Вставить(
        "ИдентификаторЛогистики", ИдентификаторЛогистики);

    ДанныеЗаявки.Вставить(
        "ИдентификаторБП",
        Строка(ДокументЗаявки.Ссылка.УникальныйИдентификатор()));

    ДанныеЗаявки.Вставить(
        "НомерЗаявкиЛогистики",
        ДокументЗаявки.НомерЗаявкиЛогистики);

    ДанныеЗаявки.Вставить(
        "НомерЗаявкиБП", ДокументЗаявки.Номер);

    ДанныеЗаявки.Вставить(
        "СуммаЗаявки", ДокументЗаявки.СуммаЗаявки);

    ДанныеЗаявки.Вставить("СуммаОплаты", СуммаОплаты);

    ДанныеЗаявки.Вставить(
        "ОстатокКОплате",
        ДокументЗаявки.СуммаЗаявки - СуммаОплаты);

    ДанныеЗаявки.Вставить(
        "БухгалтерскиеДокументы", ДокументыJSON);

    ДанныеЗаявки.Вставить("Оплаты", ОплатыJSON);

    Пакет = Новый Структура;
    Пакет.Вставить("ВерсияФормата", 1);
    Пакет.Вставить("Направление", "БухгалтерияВЛогистику");

    // Массивы содержат полный текущий набор связанных счетов
    // и оплат заявки, а не только изменения.
    Пакет.Вставить("РежимПередачи", "ПолныйСнимок");

    Пакет.Вставить(
        "ДатаВыгрузки",
        ЛГ_ДатаДляОбратногоJSON(ТекущаяДата()));

    Пакет.Вставить("Заявка", ДанныеЗаявки);

    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Пакет);

    Возврат Запись.Закрыть();

КонецФункции


&НаСервереБезКонтекста
Функция ЛГ_ДатаДляОбратногоJSON(ЗначениеДаты)

    Если Не ЗначениеЗаполнено(ЗначениеДаты) Тогда
        Возврат Неопределено;
    КонецЕсли;

    Возврат Формат(
        ЗначениеДаты, "ДФ=yyyy-MM-dd'T'HH:mm:ss");

	КонецФункции

&НаКлиенте
Процедура ОбновитьОплатыИзБанка(Команда)

    Если Не Записать() Тогда
        Возврат;
    КонецЕсли;

    Попытка

        Результат = ЛГ_ПолучитьОплатыИзБанкаНаСервере();

        Модифицированность = Истина;
        Сообщить(Результат);

    Исключение

        Сообщить(
            "Не удалось получить оплаты: " + ОписаниеОшибки());

    КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ЛГ_ПолучитьОплатыИзБанкаНаСервере()

    Запрос = Новый Запрос;

    Запрос.Текст =
        "ВЫБРАТЬ
        |   Расшифровка.Ссылка КАК Платеж,
        |   Расшифровка.Ссылка.Номер КАК Номер,
        |   Расшифровка.Ссылка.Дата КАК Дата,
        |   СУММА(Расшифровка.СуммаПлатежа) КАК Сумма
        |ИЗ
        |   Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа
        |       КАК Расшифровка
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ
        |           Документ.СчетНаОплатуПокупателю КАК Счета
        |       ПО Расшифровка.СчетНаОплату = Счета.Ссылка
        |ГДЕ
        |   Счета.ЛГ_ЗаявкаОснование = &Заявка
        |   И НЕ Счета.ПометкаУдаления
        |   И Расшифровка.Ссылка.Проведен
        |   И НЕ Расшифровка.Ссылка.ПометкаУдаления
        |   И Расшифровка.Ссылка.Организация = &Организация
        |   И Расшифровка.Ссылка.Контрагент = &Контрагент
        |
        |СГРУППИРОВАТЬ ПО
        |   Расшифровка.Ссылка,
        |   Расшифровка.Ссылка.Номер,
        |   Расшифровка.Ссылка.Дата
        |
        |УПОРЯДОЧИТЬ ПО
        |   Дата,
        |   Номер";

    Запрос.УстановитьПараметр(
        "Заявка", Объект.Ссылка);

    Запрос.УстановитьПараметр(
        "Организация", Объект.Организация);

    Запрос.УстановитьПараметр(
        "Контрагент", Объект.Контрагент);

    // Сначала выполняем запрос.
    // Если запрос завершится ошибкой, таблица формы не изменится.
    ТаблицаОплат = Запрос.Выполнить().Выгрузить();

    ДокументЗаявки = РеквизитФормыВЗначение("Объект");

    // Здесь оплаты полностью заменяются банковскими платежами.
    ДокументЗаявки.Оплаты.Очистить();

    Для Каждого БанковскийПлатеж Из ТаблицаОплат Цикл

        НоваяСтрока = ДокументЗаявки.Оплаты.Добавить();

        НоваяСтрока.ИдентификаторБП = Строка(
            БанковскийПлатеж.Платеж.УникальныйИдентификатор());

        НоваяСтрока.Дата = БанковскийПлатеж.Дата;
        НоваяСтрока.НомерДокумента = БанковскийПлатеж.Номер;
        НоваяСтрока.Сумма = БанковскийПлатеж.Сумма;

        НоваяСтрока.Комментарий =
            "Поступление на расчетный счет № "
            + СокрЛП(БанковскийПлатеж.Номер);

    КонецЦикла;

    ДокументЗаявки.СуммаОплаты =
        ДокументЗаявки.Оплаты.Итог("Сумма");

    ДокументЗаявки.СальдоКонечное =
        ДокументЗаявки.СуммаЗаявки
        - ДокументЗаявки.СуммаОплаты;

    ЗначениеВРеквизитФормы(ДокументЗаявки, "Объект");

    Возврат
        "Банковские оплаты обновлены. Найдено документов: "
        + Строка(ТаблицаОплат.Количество())
        + "; оплачено: " + Строка(ДокументЗаявки.СуммаОплаты)
        + "; остаток: " + Строка(ДокументЗаявки.СальдоКонечное)
        + ". Проверьте результат и нажмите «Записать».";

КонецФункции
